In [2]:
# 1. Exercício: Carregar um arquivo e exibir as primeiras 5 linhas.
import pandas as pd

df = pd.read_excel("dados_ausentes.xlsx")
print(df.head(5))

      Nome  Idade          Cidade  Salário
0  Gabriel   28.0       São Paulo   5500.0
1     João    NaN  Rio de Janeiro   3000.0
2    Maria   35.0        Curitiba      NaN
3     José   22.0             NaN   2000.0
4      Ana   18.0    Porto Alegre   5000.0

In [3]:
# 2. Exercício: Verificar se há valores NaN nas colunas do DataFrame.
print(df.isnull())

    Nome  Idade  Cidade  Salário
0  False  False   False    False
1  False   True   False    False
2  False  False   False     True
3  False  False    True    False
4  False  False   False    False
5  False  False   False    False
6  False  False   False    False
7  False  False   False    False

In [4]:
# 3. Exercício: Substituir os valores NaN de uma coluna por 0.
# 4. Exercício: Substituir os valores NaN de uma coluna por um valor específico
# (por exemplo, a média).
df["Idade"].fillna(df["Idade"].mean(), inplace = True)
df["Salário"].fillna(df["Salário"].mean(), inplace = True)
df["Cidade"].fillna(0, inplace = True)
print(df)

      Nome      Idade          Cidade      Salário
0  Gabriel  28.000000       São Paulo  5500.000000
1     João  30.142857  Rio de Janeiro  3000.000000
2    Maria  35.000000        Curitiba  3735.714286
3     José  22.000000               0  2000.000000
4      Ana  18.000000    Porto Alegre  5000.000000
5  Jessica  55.000000       são paulo  3150.000000
6      Ana  18.000000    Porto Alegre  5000.000000
7   Carlos  35.000000    porto alegre  2500.000000

C:\Users\42563220866\AppData\Local\Temp\ipykernel_17952\3410196650.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Idade"].fillna(df["Idade"].mean(), inplace = True)
C:\Users\42563220866\AppData\Local\Temp\ipykernel_17952\3410196650.py:5: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Salário"].fillna(df["Salário"].mean(), inplace = True)
C:\Users\42563220866\AppData\Local\Temp\ipykernel_17952\3410196650.py:6: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Cidade"].fillna(0, inplace = True)

In [5]:
# 5. Exercício: Remover todas as linhas que contêm valores NaN em qualquer coluna
df_sem_nulos = df.dropna()
print(df_sem_nulos)

      Nome      Idade          Cidade      Salário
0  Gabriel  28.000000       São Paulo  5500.000000
1     João  30.142857  Rio de Janeiro  3000.000000
2    Maria  35.000000        Curitiba  3735.714286
3     José  22.000000               0  2000.000000
4      Ana  18.000000    Porto Alegre  5000.000000
5  Jessica  55.000000       são paulo  3150.000000
6      Ana  18.000000    Porto Alegre  5000.000000
7   Carlos  35.000000    porto alegre  2500.000000

In [6]:
# 6. Exercício: Remover todas as linhas que contêm valores NaN em uma
# coluna específica.

df_sem_nulos_especifico = df.dropna(subset=['Idade'])
print(df_sem_nulos_especifico)

      Nome      Idade          Cidade      Salário
0  Gabriel  28.000000       São Paulo  5500.000000
1     João  30.142857  Rio de Janeiro  3000.000000
2    Maria  35.000000        Curitiba  3735.714286
3     José  22.000000               0  2000.000000
4      Ana  18.000000    Porto Alegre  5000.000000
5  Jessica  55.000000       são paulo  3150.000000
6      Ana  18.000000    Porto Alegre  5000.000000
7   Carlos  35.000000    porto alegre  2500.000000

In [7]:
# 7. Exercício: Substituir valores NaN de uma coluna com a mediana dessa coluna.
df["Salário"] = df["Salário"].fillna(df["Salário"].median())
print(df)

      Nome      Idade          Cidade      Salário
0  Gabriel  28.000000       São Paulo  5500.000000
1     João  30.142857  Rio de Janeiro  3000.000000
2    Maria  35.000000        Curitiba  3735.714286
3     José  22.000000               0  2000.000000
4      Ana  18.000000    Porto Alegre  5000.000000
5  Jessica  55.000000       são paulo  3150.000000
6      Ana  18.000000    Porto Alegre  5000.000000
7   Carlos  35.000000    porto alegre  2500.000000

In [8]:
# 9. Exercício: Preencher valores NaN com o valor anterior 
df['Idade'] = df['Idade'].ffill()
print(df)

      Nome      Idade          Cidade      Salário
0  Gabriel  28.000000       São Paulo  5500.000000
1     João  30.142857  Rio de Janeiro  3000.000000
2    Maria  35.000000        Curitiba  3735.714286
3     José  22.000000               0  2000.000000
4      Ana  18.000000    Porto Alegre  5000.000000
5  Jessica  55.000000       são paulo  3150.000000
6      Ana  18.000000    Porto Alegre  5000.000000
7   Carlos  35.000000    porto alegre  2500.000000

In [9]:
# 10. Exercício: Preencher valores NaN com o valor posterior
df['Cidade'] = df['Cidade'].bfill()
print(df)

      Nome      Idade          Cidade      Salário
0  Gabriel  28.000000       São Paulo  5500.000000
1     João  30.142857  Rio de Janeiro  3000.000000
2    Maria  35.000000        Curitiba  3735.714286
3     José  22.000000               0  2000.000000
4      Ana  18.000000    Porto Alegre  5000.000000
5  Jessica  55.000000       são paulo  3150.000000
6      Ana  18.000000    Porto Alegre  5000.000000
7   Carlos  35.000000    porto alegre  2500.000000

In [10]:
# 11. Exercício: Alterar todos os valores de uma coluna para maiúsculas.
df["Cidade"] = df["Cidade"].str.title()
print(df)

      Nome      Idade          Cidade      Salário
0  Gabriel  28.000000       São Paulo  5500.000000
1     João  30.142857  Rio De Janeiro  3000.000000
2    Maria  35.000000        Curitiba  3735.714286
3     José  22.000000             NaN  2000.000000
4      Ana  18.000000    Porto Alegre  5000.000000
5  Jessica  55.000000       São Paulo  3150.000000
6      Ana  18.000000    Porto Alegre  5000.000000
7   Carlos  35.000000    Porto Alegre  2500.000000

In [11]:
# 12. Exercício: Alterar todos os valores de uma coluna para minúsculas.
df["Cidade"] = df["Cidade"].str.casefold()
print(df)

      Nome      Idade          Cidade      Salário
0  Gabriel  28.000000       são paulo  5500.000000
1     João  30.142857  rio de janeiro  3000.000000
2    Maria  35.000000        curitiba  3735.714286
3     José  22.000000             NaN  2000.000000
4      Ana  18.000000    porto alegre  5000.000000
5  Jessica  55.000000       são paulo  3150.000000
6      Ana  18.000000    porto alegre  5000.000000
7   Carlos  35.000000    porto alegre  2500.000000

In [12]:
# 13. Exercício: Remover espaços em branco à esquerda e à direita em uma coluna.
df['Cidade'] = df['Cidade'].str.strip() 
print(df)

      Nome      Idade          Cidade      Salário
0  Gabriel  28.000000       são paulo  5500.000000
1     João  30.142857  rio de janeiro  3000.000000
2    Maria  35.000000        curitiba  3735.714286
3     José  22.000000             NaN  2000.000000
4      Ana  18.000000    porto alegre  5000.000000
5  Jessica  55.000000       são paulo  3150.000000
6      Ana  18.000000    porto alegre  5000.000000
7   Carlos  35.000000    porto alegre  2500.000000

In [13]:
#14. Exercício: Substituir valores de uma coluna com base em um dicionário de mapeamento (ex: "São Paulo" para "SP".)
df['Cidade'].str.lower().replace({'são paulo': 'SP', 'rio de janeiro': 'RJ', 'porto alegre': 'PA'})
print(df)

      Nome      Idade          Cidade      Salário
0  Gabriel  28.000000       são paulo  5500.000000
1     João  30.142857  rio de janeiro  3000.000000
2    Maria  35.000000        curitiba  3735.714286
3     José  22.000000             NaN  2000.000000
4      Ana  18.000000    porto alegre  5000.000000
5  Jessica  55.000000       são paulo  3150.000000
6      Ana  18.000000    porto alegre  5000.000000
7   Carlos  35.000000    porto alegre  2500.000000

In [17]:
# 15. Exercício: Identificar e remover valores duplicados de um DataFrame.
df = df.drop_duplicates(subset=['Nome'])
print(df)

      Nome      Idade          Cidade      Salário
0  Gabriel  28.000000       são paulo  5500.000000
1     João  30.142857  rio de janeiro  3000.000000
2    Maria  35.000000        curitiba  3735.714286
3     José  22.000000             NaN  2000.000000
4      Ana  18.000000    porto alegre  5000.000000
5  Jessica  55.000000       são paulo  3150.000000
7   Carlos  35.000000    porto alegre  2500.000000